tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "solverControls"

libs            ("libliquidPropertiesFvPatchFields.so");

application     chtMultiRegionFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         90;

deltaT          0.01;

writeControl    adjustableRunTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxDi           10e3;

functions
{
    H2O
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");
        resetOnStartUp  no;
        region          cabin;
        field           H2O;

        fvOptions
        {
        }
    }

    fileUpdate
    {
        type                timeActivatedFileUpdate;
        libs                ("libutilityFunctionObjects.so");
        writeControl        timeStep;
        writeInterval       1;
        region              cabin;
        fileToUpdate        "<system>/solverControls";

        timeVsFile
        (
            ( 1     "<system>/solverControls.0" )
            ( 5     "<system>/solverControls.5" )
            ( 20    "<system>/solverControls.20")
            ( 60    "<system>/solverControls.60")
        );
    }
}


// ************************************************************************* //
